src/test/resources/GetDataAvailabilityRequest.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><ns:GetDataAvailability service="SOS" version="2.0.0" xsi:schemaLocation="http://www.opengis.net/sosgda/1.0 http://waterml2.org/schemas/gda/1.0/gda.xsd http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd" xmlns:ns="http://www.opengis.net/sosgda/1.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><ns:procedure>Einzelwert</ns:procedure><ns:observedProperty>Wassertemperatur</ns:observedProperty><ns:featureOfInterest>Laaken</ns:featureOfInterest><ns:offering>Zeitreihen_Einzelwert</ns:offering></ns:GetDataAvailability></soap:Body></soap:Envelope>